; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-1-194)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-4 - location
	p5-0 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p1-2 - location
	p1-5 - location
	p1-6 - location
	p3-0 - location
	p3-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s4)
	(at driver5 s3)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s6)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s5)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s5)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 2)
	(= (time-to-walk p0-4 s0) 2)
	(= (time-to-walk s4 p0-4) 17)
	(= (time-to-walk p0-4 s4) 17)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 1)
	(= (time-to-walk p5-0 s5) 1)
	(= (time-to-walk s0 p5-0) 4)
	(= (time-to-walk p5-0 s0) 4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 6)
	(= (time-to-walk p2-0 s2) 6)
	(= (time-to-walk s0 p2-0) 6)
	(= (time-to-walk p2-0 s0) 6)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 8)
	(= (time-to-walk p2-3 s2) 8)
	(= (time-to-walk s3 p2-3) 11)
	(= (time-to-walk p2-3 s3) 11)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 16)
	(= (time-to-walk p2-4 s2) 16)
	(= (time-to-walk s4 p2-4) 3)
	(= (time-to-walk p2-4 s4) 3)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 1)
	(= (time-to-walk p2-6 s2) 1)
	(= (time-to-walk s6 p2-6) 3)
	(= (time-to-walk p2-6 s6) 3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 11)
	(= (time-to-walk p1-2 s1) 11)
	(= (time-to-walk s2 p1-2) 6)
	(= (time-to-walk p1-2 s2) 6)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 3)
	(= (time-to-walk p1-5 s1) 3)
	(= (time-to-walk s5 p1-5) 10)
	(= (time-to-walk p1-5 s5) 10)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 8)
	(= (time-to-walk p1-6 s1) 8)
	(= (time-to-walk s6 p1-6) 4)
	(= (time-to-walk p1-6 s6) 4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 13)
	(= (time-to-walk p3-0 s3) 13)
	(= (time-to-walk s0 p3-0) 12)
	(= (time-to-walk p3-0 s0) 12)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 8)
	(= (time-to-walk p3-1 s3) 8)
	(= (time-to-walk s1 p3-1) 16)
	(= (time-to-walk p3-1 s1) 16)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 6)
	(= (time-to-drive s0 s5) 6)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 11)
	(= (time-to-drive s6 s5) 11)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 1)
	(= (time-to-drive s0 s1) 1)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 11)
	(= (time-to-drive s5 s1) 11)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 14)
	(= (time-to-drive s4 s6) 14)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 8)
	(= (time-to-drive s0 s3) 8)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 8)
	(= (time-to-drive s1 s3) 8)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 5)
	(= (time-to-drive s2 s3) 5)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 11)
	(= (time-to-drive s5 s3) 11)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 17)
	(= (time-to-drive s6 s3) 17)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 17)
	(= (time-to-drive s0 s4) 17)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 19)
	(= (time-to-drive s0 s2) 19)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 19)
	(= (time-to-drive s1 s2) 19)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 11)
	(= (time-to-drive s4 s2) 11)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 5)
	(= (time-to-drive s5 s2) 5)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s5)
	(at truck1 s0)
	(at truck3 s0)
	(at truck4 s5)
	(at package1 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver3 s3 p3-0)
   deleted: (at driver3 s3)
   added: (at driver3 p3-0)
   goals met: 1 of 8
2. (board-truck driver5 truck3 s3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 1 of 8
3. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   goals met: 1 of 8
4. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   goals met: 1 of 8
5. (walk driver3 p3-0 s0)
   deleted: (at driver3 p3-0)
   added: (at driver3 s0)
   goals met: 2 of 8
6. (walk driver2 s2 p1-2)
   deleted: (at driver2 s2)
   added: (at driver2 p1-2)
   goals met: 2 of 8
7. (walk driver2 p1-2 s1)
   deleted: (at driver2 p1-2)
   added: (at driver2 s1)
   goals met: 3 of 8
8. (walk driver4 s4 p0-4)
   deleted: (at driver4 s4)
   added: (at driver4 p0-4)
   goals met: 3 of 8
9. (walk driver4 p0-4 s0)
   deleted: (at driver4 p0-4)
   added: (at driver4 s0)
   goals met: 3 of 8
10. (walk driver4 s0 p5-0)
   deleted: (at driver4 s0)
   added: (at driver4 p5-0)
   goals met: 3 of 8
11. (walk driver4 p5-0 s5)
   deleted: (at driver4 p5-0)
   added: (at driver4 s5)
   goals met: 4 of 8
12. (drive-truck truck3 s3 s0 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 80
   goals met: 5 of 8
13. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 8
14. (drive-truck truck4 s1 s5 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (fuel-used) from 80 to 190
   goals met: 5 of 8
15. (load-truck package1 truck4 s5)
   deleted: (at package1 s5)
   added: (in package1 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 5 of 8
16. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 190 to 200
   goals met: 4 of 8
17. (disembark-truck driver5 truck3 s1)
   deleted: (driving driver5 truck3)
   added: (at driver5 s1) (empty truck3)
   goals met: 4 of 8
18. (board-truck driver5 truck1 s1)
   deleted: (at driver5 s1) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 4 of 8
19. (drive-truck truck1 s1 s0 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 200 to 210
   goals met: 5 of 8
20. (drive-truck truck4 s5 s1 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   changed: (fuel-used) from 210 to 331
   goals met: 4 of 8
21. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 5 of 8
22. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 5 of 8
23. (drive-truck truck1 s0 s3 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 331 to 411
   goals met: 4 of 8
24. (load-truck package1 truck4 s1)
   deleted: (at package1 s1)
   added: (in package1 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 4 of 8
25. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 8
26. (drive-truck truck4 s1 s3 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 411 to 499
   goals met: 3 of 8
27. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 2 of 8
28. (drive-truck truck1 s3 s0 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 499 to 579
   goals met: 3 of 8
29. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 3 of 8
30. (board-truck driver4 truck3 s1)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 3 of 8
31. (drive-truck truck3 s1 s5 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 579 to 689
   goals met: 3 of 8
32. (drive-truck truck4 s3 s1 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (fuel-used) from 689 to 777
   goals met: 3 of 8
33. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 4 of 8
34. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 4 of 8
35. (drive-truck truck3 s5 s1 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 777 to 887
   goals met: 4 of 8
36. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 8
37. (drive-truck truck3 s1 s5 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 887 to 1008
   goals met: 4 of 8
38. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 5 of 8
39. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 8
40. (drive-truck truck4 s1 s5 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (fuel-used) from 1008 to 1118
   goals met: 5 of 8
41. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 8
42. (drive-truck truck4 s5 s1 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   changed: (fuel-used) from 1118 to 1228
   goals met: 4 of 8
43. (board-truck driver4 truck3 s5)
   deleted: (at driver4 s5) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 3 of 8
44. (drive-truck truck3 s5 s0 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 1228 to 1288
   goals met: 4 of 8
45. (drive-truck truck1 s0 s3 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 1288 to 1368
   goals met: 3 of 8
46. (drive-truck truck3 s0 s5 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 1368 to 1428
   goals met: 2 of 8
47. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 3 of 8
48. (disembark-truck driver2 truck4 s1)
   deleted: (driving driver2 truck4)
   added: (at driver2 s1) (empty truck4)
   goals met: 4 of 8
49. (load-truck package1 truck5 s5)
   deleted: (at package1 s5)
   added: (in package1 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 4 of 8
50. (board-truck driver4 truck5 s5)
   deleted: (at driver4 s5) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 3 of 8
51. (board-truck driver2 truck4 s1)
   deleted: (at driver2 s1) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 2 of 8
52. (drive-truck truck5 s5 s3 driver4)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   changed: (fuel-used) from 1428 to 1549
   goals met: 2 of 8
53. (unload-truck package1 truck5 s3)
   deleted: (in package1 truck5)
   added: (at package1 s3)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 3 of 8
54. (drive-truck truck4 s1 s5 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (fuel-used) from 1549 to 1659
   goals met: 4 of 8
55. (disembark-truck driver2 truck4 s5)
   deleted: (driving driver2 truck4)
   added: (at driver2 s5) (empty truck4)
   goals met: 4 of 8
56. (walk driver2 s5 p1-5)
   deleted: (at driver2 s5)
   added: (at driver2 p1-5)
   goals met: 4 of 8
57. (walk driver2 p1-5 s1)
   deleted: (at driver2 p1-5)
   added: (at driver2 s1)
   goals met: 5 of 8
58. (walk driver1 s0 p5-0)
   deleted: (at driver1 s0)
   added: (at driver1 p5-0)
   goals met: 4 of 8
59. (drive-truck truck1 s3 s0 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 1659 to 1739
   goals met: 5 of 8
60. (walk driver1 p5-0 s5)
   deleted: (at driver1 p5-0)
   added: (at driver1 s5)
   goals met: 5 of 8
61. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 8
62. (drive-truck truck3 s5 s0 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 1739 to 1799
   goals met: 6 of 8
63. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 7 of 8
64. (drive-truck truck5 s3 s5 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   changed: (fuel-used) from 1799 to 1909
   goals met: 7 of 8
65. (disembark-truck driver4 truck5 s5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s5) (empty truck5)
   goals met: 8 of 8
